devise/app/models/user.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'conggiap1308@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`) VALUES ('conggiap1308@gmail.com', '$2a$12$nktdVCcOzpf8PyrPSQxV5eACnItc0tYZRXjLLnvPsqZfy/UDbNf.m', '2021-09-06 09:07:04.289972', '2021-09-06 09:07:04.289972', 'facebook', '2332087503608261')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '2332087503608261' ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.from_omniauth(auth)
  result = User.where(email: auth.info.email).first
  if result
    return result
  else
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|