chapter-04/app/views/users/new.html.erb

SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'giap1@email.com' LIMIT 1
---
    <div class="controls">
      <input type="text" id="email" name="user[email]" placeholder="" class="input-xlarge" value="<%= @user.email.present? ? @user.email : ''%> ">