chapter-03/app/controllers/microposts_controller.rb

SELECT `microposts`.* FROM `microposts`
---
  def index
    @microposts = Micropost.all

INSERT INTO `microposts` (`user_id`, `content`, `created_at`, `updated_at`) VALUES (4, 'ssfdsfgs', '2021-07-30 14:07:49.877145', '2021-07-30 14:07:49.877145')
---
  def create
    @micropost = Micropost.new(micropost_params)
    if @micropost.save

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1
---
    def set_micropost
      @micropost = Micropost.find(params[:id])