chapter-03/app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by email: params[:password_reset][:email].downcase
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rubytest61@gmail.com' LIMIT 1

  def update
    if user_params[:password].empty?
      flash[:danger] = "Password not empty"
      render :edit
    elsif @user.update user_params
---
UPDATE `users` SET `users`.`updated_at` = '2021-08-07 14:25:06.479182', `users`.`password_digest` = '$2a$12$lAvkW5vi3aCOnAnFnDzSqesLYojx1yM5bc93FfTiLoSMBjBMQpZRW' WHERE `users`.`id` = 31

  def get_user
    @user = User.find_by email: params[:email]
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rubytest61@gmail.com' LIMIT 1