chapter-03/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'giap1@mail.com'
---
  def index
    # @users = User.all
    @email = params[:email]
    @users =  (@email.present? ? User.where(email: @email) : User.all).paginate(page: params[:page])

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 4
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def show
    @user =  User.includes(:microposts).find_by(id: params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def contacts
    @user = User.find_by id: session[:user_id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def edit
    @user = User.find_by(id: params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `gender`, `password_digest`, `activation_digest`) VALUES ('giap1', 'giap1@email.com', '2021-08-06 03:27:22.781400', '2021-08-06 03:27:22.781400', 'female', '$2a$12$DasR7mXhBGp.ZKGeOmqO/eeWO8MQKTAhWiml7slNMLb4Cx1s3uaGe', '$2a$12$axWq5eDTLLX8DdF2snl5KO0/ZXX.JiuKqQJVE9FFevwue6NiggDGO')
---
  def create
    @user = User.new(user_params) # Not the final implementation!
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 28 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2021-08-07 14:23:58.358041', `users`.`school` = ' ', `users`.`admin` = FALSE WHERE `users`.`id` = 30
---
  def update
    @user = User.find_by(id: params[:id])
    if @user.update user_params

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 35
---
  def destroy
    user = User.find_by(id: params[:id])
    if user&.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1
---
    def correct_user
      @user = User.find(params[:id])