chapter-01/app/controllers/users_controller.rb

  def index
    # @users = User.all
    @email = params[:email]
    @users =  @email.present? ? User.where(email: @email) : User.all
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'giap1@mail.com'

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `phone`, `age`, `created_at`, `updated_at`) VALUES ('giap', 'giap1@mail.com', 12345, 12, '2021-07-18 07:26:14.511475', '2021-07-18 07:26:14.511475')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`age` = 114, `users`.`updated_at` = '2021-07-18 07:29:03.617385' WHERE `users`.`id` = 1

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 1

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1