chapter-03/app/views/users/_form.html.erb

    <div class="controls">
      <input type="text" id="email" name="user[email]" placeholder="" class="input-xlarge" value="<%= @user.email.present? ? @user.email : ''%> ">
---
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'giap3@gmail.com' AND `users`.`id` != 3 LIMIT 1