chapter-03/app/views/users/show.html.erb

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 4
---
<div>
<% @user.microposts.each do |micro| %>