chapter-04/app/controllers/sessions_controller.rb

  def create
    user =User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'giap1@email.com' LIMIT 1