chapter-04/app/controllers/users_controller.rb

  def index
    # @users = User.all
    @email = params[:email]
    @users =  @email.present? ? User.where(email: @email) : User.all
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'giap1@mail.com'

  def show
    @user = User.find_by id: params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def contacts
    @user = User.find_by id: session[:user_id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def create
    @user = User.new(user_params) # Not the final implementation!
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `gender`, `password_digest`) VALUES ('gi', 'giap1112@gmail.com', '2021-07-27 08:26:14.566345', '2021-07-27 08:26:14.566345', 'female', '$2a$12$3mpBgdmgGiJKtOVt/2M3h.o1AwR/zZQG.Ba24oREb3wnyZ6ZbMQo.')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`updated_at` = '2021-07-19 14:33:29.937106', `users`.`gender` = 'Nam', `users`.`school` = '' WHERE `users`.`id` = 4

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 31

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1